const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});


// 2 + 5 เท่ากับ 7
test('2 + 5 เท่ากับ 7',()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 111 + 0 เท่ากับ 111
test('111 + 0 เท่ากับ 111',()=> {
  expect(sum(111,0)).toBe(111);
});

// 23 + 5 เท่ากับ 28.50
test('23 + 5.50 เท่ากับ 28.50',()=> {
 expect(sum(23,5.50)).toBe(28.50);
});

// 0.1 + 0.99 เท่ากับ 1.09
test('0.1 + 0.99 เท่ากับ 1.09',()=> {
 expect(sum(0.1,0.99)).toBe(1.09);
});
